-- --------------------------------------------------------
-- Host:                         127.0.0.1
-- Server version:               5.5.39 - MySQL Community Server (GPL)
-- Server OS:                    Win32
-- HeidiSQL Version:             9.1.0.4882
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

-- Dumping database structure for 3724_3725_3726
CREATE DATABASE IF NOT EXISTS `3724_3725_3726` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `3724_3725_3726`;


-- Dumping structure for table 3724_3725_3726.questions
CREATE TABLE IF NOT EXISTS `questions` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `question` varchar(250) NOT NULL DEFAULT '',
  `ans1` varchar(80) NOT NULL DEFAULT '',
  `ans2` varchar(80) NOT NULL DEFAULT '',
  `ans3` varchar(80) NOT NULL DEFAULT '',
  `ans4` varchar(80) NOT NULL DEFAULT '',
  `ans5` varchar(80) NOT NULL DEFAULT '',
  `corans` varchar(8) NOT NULL DEFAULT '',
  `subject_ID` int(11) NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- Dumping data for table 3724_3725_3726.questions: 13 rows
/*!40000 ALTER TABLE `questions` DISABLE KEYS */;
INSERT INTO `questions` (`ID`, `question`, `ans1`, `ans2`, `ans3`, `ans4`, `ans5`, `corans`, `subject_ID`) VALUES
	(1, 'Τα κύρια στοιχεία ενός τριγώνου είναι:', 'οι πλευρές και οι διχοτόμοι', 'οι πλευρές και τα ύψη', 'οι πλευρές και οι γωνίες', 'οι γωνίες και οι διχοτόμοι', 'οι γωνίες και οι διάμεσοι', 'ans3', 2),
	(2, 'Σ’ ένα τρίγωνο ισχύει α=γ. Ποιο από τα παρακάτω είναι το σωστό:', 'Α ̂=Γ ̂', 'Α ̂=Β ̂', 'Β ̂=Γ ̂', 'Α ̂=Β ̂=Γ ̂', 'Α ̂=Β ̂≠Γ ̂', 'ans1', 2),
	(3, 'Τα κριτήρια ισότητας τριγώνων είναι τα:', 'Π-Π-Π, Π-Π-Γ, Γ-Π-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Γ-Π', 'Π-Π-Π, Π-Γ-Π, Π-Γ-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Π-Γ', 'Π-Π-Π, Π-Γ-Π, Γ-Π-Γ', 'ans5', 2),
	(4, 'Ποιο από τα παρακάτω είναι σωστό;', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ομοίως άνισα.', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ανομοίως άνισα', 'Αν δύο χορδές ενός κύκλου είναι ομοίως άνισες, τότε και τα τόξα τους είναι ίσα.', 'Αν δύο χορδές ενός κύκλου είναι ανομοίως άνισες, τότε και τα τόξα τους είναι ίσα', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ίσα και αντιστ', 'ans5', 2),
	(5, 'Ανάλογα με τις πλευρές τα τρίγωνα διακρίνονται σε:', 'οξυγώνια, αμβλυγώνια και σκαληνά', 'σκαληνά, ισόπλευρα και ισοσκελή', 'σκαληνά, ισοσκελή και οξυγώνια', 'σκαληνά, ισόπλευρα και οξυγώνια', 'σκαληνά, ισόπλευρα και αμβλυγώνια', 'ans2', 2),
	(6, 'Σε κάθε ισοσκελές τρίγωνο:', 'Το ύψος που φέρουμε από την κορυφή του είναι διάμεσος και μεσοκάθετος.', 'Η διάμεσος που φέρουμε από την κορυφή του είναι μεσοκάθετος και διχοτόμος.', 'Η διχοτόμος της γωνίας της κορυφής είναι διάμεσος και ύψος.', 'Η μεσοκάθετος είναι διάμεσος και διχοτόμος.', 'Η διάμεσος είναι ύψος και διχοτόμος.', 'ans3', 2),
	(7, 'Ποιο από τα παρακάτω είναι το σωστό:', 'Διάμεσος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τε', 'Διάμεσος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τελ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'ans3', 2),
	(8, 'Δίνεται τρίγωνο ΑΒΓ με πλευρές α,β,γ.', 'Αν α=β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β και β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν α≠β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'ans2', 2),
	(9, 'Δίνεται τρίγωνο ΑΒΓ με γωνίες Α,Β,Γ.', 'Αν Α ̂≠Β ̂≠Γ ̂≠Α ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂ και Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν Α ̂=Β ̂≠Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'ans4', 2),
	(10, 'Ποιο από τα παρακάτω είναι σίγουρα λάθος:', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ έν', 'Ύψος τριγώνου λέγεται το κάθετο ευθύγραμμο τμήμα, που φέρεται από μια κορυφή προ', 'Το ύψος τριγώνου που φέρεται από μια κορυφή προς την απέναντι πλευρά, σχηματίζει', 'Ύψος τριγώνου είναι η απόσταση μιας κορυφής του από την απέναντι πλευρά.', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ έν', 'ans5', 2),
	(11, 'Ποιο από τα παρακάτω είναι η χαρακτηριστική ιδιότητα της μεσοκαθέτου ευθυγράμμου τμήματος;', 'Κάθε σημείο της ισαπέχει από το ευθύγραμμο τμήμα και αντιστρόφως.', 'Κάθε σημείο της ισαπέχει από το μέσο του ευθυγράμμου τμήματος και αντιστρόφως.', 'Διέρχεται από το μέσο του ευθυγράμμου τμήματος και είναι κάθετη σε αυτό.', 'Κάθε σημείο της ισαπέχει από τα άκρα του ευθυγράμμου τμήματος και αντιστρόφως.', 'Είναι κάθετη στο μέσον του ευθυγράμμου τμήματος.', 'ans4', 2),
	(12, 'Ποιο από τα παρακάτω είναι το σωστό:', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'Διχοτόμος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τ', 'Διχοτόμος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τε', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'ans1', 2),
	(13, 'Ανάλογα με τις γωνίες τα τρίγωνα διακρίνονται σε:', 'οξυγώνια, αμβλυγώνια και ορθογώνια', 'οξυγώνια, αμβλυγώνια και ισοσκελή', 'οξυγώνια, ορθογώνια και ισόπλευρα', 'οξυγώνια, ισόπλευρα και σκαληνά', 'ορθογώνια, ισόπλευρα και αμβλυγώνια', 'ans1', 2);
/*!40000 ALTER TABLE `questions` ENABLE KEYS */;


-- Dumping structure for table 3724_3725_3726.scores
CREATE TABLE IF NOT EXISTS `scores` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `user_name` char(5) NOT NULL,
  `score` int(11) NOT NULL,
  `subject_ID` int(11) NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- Dumping data for table 3724_3725_3726.scores: 0 rows
/*!40000 ALTER TABLE `scores` DISABLE KEYS */;
/*!40000 ALTER TABLE `scores` ENABLE KEYS */;


-- Dumping structure for table 3724_3725_3726.subjects
CREATE TABLE IF NOT EXISTS `subjects` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `subject_name` varchar(20) NOT NULL DEFAULT '',
  `description` varchar(80) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- Dumping data for table 3724_3725_3726.subjects: 7 rows
/*!40000 ALTER TABLE `subjects` DISABLE KEYS */;
INSERT INTO `subjects` (`ID`, `subject_name`, `description`) VALUES
	(1, 'ΑΛΓΕΒΡΑ_Α', 'ΑΛΓΕΒΡΑ Α ΛΥΚΕΙΟΥ'),
	(2, 'ΓΕΩΜΕΤΡΙΑ_Α', 'ΓΕΩΜΕΤΡΙΑ Α ΛΥΚΕΙΟΥ'),
	(3, 'ΑΛΓΕΒΡΑ_Β', 'ΑΛΓΕΒΡΑ Β ΛΥΞΕΙΟΥ'),
	(4, 'ΓΕΩΜΕΤΡΙΑ_Β', 'ΓΕΩΜΕΤΡΙΑ Β ΛΥΚΕΙΟΥ'),
	(5, 'ΜΑΘΗΜΑΤΙΚΑ_Β', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Β ΛΥΚΕΙΟΥ'),
	(6, 'ΜΑΘΗΜΑΤΙΚΑ_Γ', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Γ ΛΥΚΕΙΟΥ'),
	(7, 'ΣΤΑΤΙΣΤΙΚΗ_Γ', 'ΣΤΑΤΙΣΤΙΚΗ Γ ΛΥΚΕΙΟΥ');
/*!40000 ALTER TABLE `subjects` ENABLE KEYS */;


-- Dumping structure for table 3724_3725_3726.user
CREATE TABLE IF NOT EXISTS `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` char(5) NOT NULL,
  `password` char(5) NOT NULL,
  `role` tinyint(1) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- Dumping data for table 3724_3725_3726.user: 2 rows
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` (`id`, `username`, `password`, `role`) VALUES
	(1, 'admin', 'admin', 1),
	(2, 'user1', 'user1', 0);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
