-- phpMyAdmin SQL Dump
-- version 2.10.3
-- http://www.phpmyadmin.net
-- 
-- Σύστημα: localhost
-- Χρόνος δημιουργίας: 23 Δεκ 2014, στις 05:34 PM
-- Έκδοση Διακομιστή: 5.0.51
-- Έκδοση PHP: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- Βάση: `3724_3725_3726`
-- 
CREATE DATABASE `3724_3725_3726` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `3724_3725_3726`;

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `questions`
-- 

CREATE TABLE `questions` (
  `ID` int(4) NOT NULL auto_increment,
  `question` varchar(250) NOT NULL default '',
  `test` varchar(31) NOT NULL default '',
  `ans1` varchar(80) NOT NULL default '',
  `ans2` varchar(80) NOT NULL default '',
  `ans3` varchar(80) NOT NULL default '',
  `ans4` varchar(80) NOT NULL default '',
  `ans5` varchar(80) NOT NULL default '',
  `corans` varchar(8) NOT NULL default '',
  `expl` text NOT NULL,
  PRIMARY KEY  (`ID`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=14 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `questions`
-- 

INSERT INTO `questions` VALUES (1, 'Τα κύρια στοιχεία ενός τριγώνου είναι:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'οι πλευρές και οι διχοτόμοι', 'οι πλευρές και τα ύψη', 'οι πλευρές και οι γωνίες', 'οι γωνίες και οι διχοτόμοι', 'οι γωνίες και οι διάμεσοι', 'ans3', '');
INSERT INTO `questions` VALUES (2, 'Σ’ ένα τρίγωνο ισχύει α=γ. Ποιο από τα παρακάτω είναι το σωστό:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Α ̂=Γ ̂', 'Α ̂=Β ̂', 'Β ̂=Γ ̂', 'Α ̂=Β ̂=Γ ̂', 'Α ̂=Β ̂≠Γ ̂', 'ans1', '');
INSERT INTO `questions` VALUES (3, 'Τα κριτήρια ισότητας τριγώνων είναι τα:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Π-Π-Π, Π-Π-Γ, Γ-Π-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Γ-Π', 'Π-Π-Π, Π-Γ-Π, Π-Γ-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Π-Γ', 'Π-Π-Π, Π-Γ-Π, Γ-Π-Γ', 'ans5', '');
INSERT INTO `questions` VALUES (4, 'Ποιο από τα παρακάτω είναι σωστό;', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ομοίως άνισα.', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ανομοίως άνισα', 'Αν δύο χορδές ενός κύκλου είναι ομοίως άνισες, τότε και τα τόξα τους είναι ίσα.', 'Αν δύο χορδές ενός κύκλου είναι ανομοίως άνισες, τότε και τα τόξα τους είναι ίσα', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ίσα και αντιστ', 'ans5', '');
INSERT INTO `questions` VALUES (5, 'Ανάλογα με τις πλευρές τα τρίγωνα διακρίνονται σε:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'οξυγώνια, αμβλυγώνια και σκαληνά', 'σκαληνά, ισόπλευρα και ισοσκελή', 'σκαληνά, ισοσκελή και οξυγώνια', 'σκαληνά, ισόπλευρα και οξυγώνια', 'σκαληνά, ισόπλευρα και αμβλυγώνια', 'ans2', '');
INSERT INTO `questions` VALUES (6, 'Σε κάθε ισοσκελές τρίγωνο:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Το ύψος που φέρουμε από την κορυφή του είναι διάμεσος και μεσοκάθετος.', 'Η διάμεσος που φέρουμε από την κορυφή του είναι μεσοκάθετος και διχοτόμος.', 'Η διχοτόμος της γωνίας της κορυφής είναι διάμεσος και ύψος.', 'Η μεσοκάθετος είναι διάμεσος και διχοτόμος.', 'Η διάμεσος είναι ύψος και διχοτόμος.', 'ans3', '');
INSERT INTO `questions` VALUES (7, 'Ποιο από τα παρακάτω είναι το σωστό:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Διάμεσος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τε', 'Διάμεσος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τελ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ', 'ans3', '');
INSERT INTO `questions` VALUES (8, 'Δίνεται τρίγωνο ΑΒΓ με πλευρές α,β,γ.', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Αν α=β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β και β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν α≠β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'ans2', '');
INSERT INTO `questions` VALUES (9, 'Δίνεται τρίγωνο ΑΒΓ με γωνίες Α,Β,Γ.', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Αν Α ̂≠Β ̂≠Γ ̂≠Α ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂ και Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν Α ̂=Β ̂≠Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'ans4', '');
INSERT INTO `questions` VALUES (10, 'Ποιο από τα παρακάτω είναι σίγουρα λάθος:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ έν', 'Ύψος τριγώνου λέγεται το κάθετο ευθύγραμμο τμήμα, που φέρεται από μια κορυφή προ', 'Το ύψος τριγώνου που φέρεται από μια κορυφή προς την απέναντι πλευρά, σχηματίζει', 'Ύψος τριγώνου είναι η απόσταση μιας κορυφής του από την απέναντι πλευρά.', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ έν', 'ans5', '');
INSERT INTO `questions` VALUES (11, 'Ποιο από τα παρακάτω είναι η χαρακτηριστική ιδιότητα της μεσοκαθέτου ευθυγράμμου τμήματος;', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Κάθε σημείο της ισαπέχει από το ευθύγραμμο τμήμα και αντιστρόφως.', 'Κάθε σημείο της ισαπέχει από το μέσο του ευθυγράμμου τμήματος και αντιστρόφως.', 'Διέρχεται από το μέσο του ευθυγράμμου τμήματος και είναι κάθετη σε αυτό.', 'Κάθε σημείο της ισαπέχει από τα άκρα του ευθυγράμμου τμήματος και αντιστρόφως.', 'Είναι κάθετη στο μέσον του ευθυγράμμου τμήματος.', 'ans4', '');
INSERT INTO `questions` VALUES (12, 'Ποιο από τα παρακάτω είναι το σωστό:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'Διχοτόμος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τ', 'Διχοτόμος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τε', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου ', 'ans1', '');
INSERT INTO `questions` VALUES (13, 'Ανάλογα με τις γωνίες τα τρίγωνα διακρίνονται σε:', 'ΓΕΩΜΕΤΡΙΑ_Α', 'οξυγώνια, αμβλυγώνια και ορθογώνια', 'οξυγώνια, αμβλυγώνια και ισοσκελή', 'οξυγώνια, ορθογώνια και ισόπλευρα', 'οξυγώνια, ισόπλευρα και σκαληνά', 'ορθογώνια, ισόπλευρα και αμβλυγώνια', 'ans1', '');

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `subjects`
-- 

CREATE TABLE `subjects` (
  `ID` int(4) NOT NULL auto_increment,
  `cat` varchar(31) NOT NULL default '',
  `descr` varchar(80) NOT NULL default '',
  `random` int(1) default NULL,
  PRIMARY KEY  (`ID`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=8 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `subjects`
-- 

INSERT INTO `subjects` VALUES (1, 'ΑΛΓΕΒΡΑ_Α', 'ΑΛΓΕΒΡΑ Α ΛΥΚΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (2, 'ΓΕΩΜΕΤΡΙΑ_Α', 'ΓΕΩΜΕΤΡΙΑ Α ΛΥΚΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (3, 'ΑΛΓΕΒΡΑ_Β', 'ΑΛΓΕΒΡΑ Β ΛΥΞΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (4, 'ΓΕΩΜΕΤΡΙΑ_Β', 'ΓΕΩΜΕΤΡΙΑ Β ΛΥΚΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (5, 'ΜΑΘΗΜΑΤΙΚΑ_Β', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Β ΛΥΚΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (6, 'ΜΑΘΗΜΑΤΙΚΑ_Γ', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Γ ΛΥΚΕΙΟΥ', NULL);
INSERT INTO `subjects` VALUES (7, 'ΣΤΑΤΙΣΤΙΚΗ_Γ', 'ΣΤΑΤΙΣΤΙΚΗ Γ ΛΥΚΕΙΟΥ', NULL);

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `user`
-- 

CREATE TABLE `user` (
  `id` int(11) NOT NULL auto_increment,
  `username` char(5) NOT NULL,
  `password` char(5) NOT NULL,
  `role` tinyint(1) NOT NULL default '0',
  PRIMARY KEY  (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=4 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `user`
-- 

INSERT INTO `user` VALUES (1, 'admin', 'admin', 1);
INSERT INTO `user` VALUES (2, 'user1', 'user1', 0);
