-- phpMyAdmin SQL Dump
-- version 2.10.3
-- http://www.phpmyadmin.net
-- 
-- Σύστημα: localhost
-- Χρόνος δημιουργίας: 04 Ιαν 2015, στις 09:20 PM
-- Έκδοση Διακομιστή: 5.0.51
-- Έκδοση PHP: 5.2.6

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";

-- 
-- Βάση: `3724_3725_3726`
-- 
CREATE DATABASE `3724_3725_3726` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `3724_3725_3726`;

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `questions`
-- 

CREATE TABLE `questions` (
  `ID` int(11) NOT NULL auto_increment,
  `question` varchar(255) NOT NULL default '',
  `ans1` varchar(255) NOT NULL default '',
  `ans2` varchar(255) NOT NULL default '',
  `ans3` varchar(255) NOT NULL default '',
  `ans4` varchar(255) NOT NULL default '',
  `ans5` varchar(255) NOT NULL default '',
  `corans` varchar(8) NOT NULL default '',
  `subject_ID` int(11) NOT NULL,
  PRIMARY KEY  (`ID`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=17 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `questions`
-- 

INSERT INTO `questions` VALUES (11, 'Ποιο από τα παρακάτω είναι η χαρακτηριστική ιδιότητα της μεσοκαθέτου ευθυγράμμου τμήματος;', 'Κάθε σημείο της ισαπέχει από το ευθύγραμμο τμήμα και αντιστρόφως.', 'Κάθε σημείο της ισαπέχει από το μέσο του ευθυγράμμου τμήματος και αντιστρόφως.', 'Διέρχεται από το μέσο του ευθυγράμμου τμήματος και είναι κάθετη σε αυτό.', 'Κάθε σημείο της ισαπέχει από τα άκρα του ευθυγράμμου τμήματος και αντιστρόφως.', 'Είναι κάθετη στο μέσον του ευθυγράμμου τμήματος.', 'ans4', 2);
INSERT INTO `questions` VALUES (10, 'Ποιο από τα παρακάτω είναι σίγουρα λάθος:', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και είναι κάθετο στην πλευρά αυτή.', 'Ύψος τριγώνου λέγεται το κάθετο ευθύγραμμο τμήμα, που φέρεται από μια κορυφή προς την ευθεία της απέναντι πλευράς.', 'Το ύψος τριγώνου που φέρεται από μια κορυφή προς την απέναντι πλευρά, σχηματίζει ορθή γωνία με την πλευρά αυτή.', 'Ύψος τριγώνου είναι η απόσταση μιας κορυφής του από την απέναντι πλευρά.', 'Ύψος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και σχηματίζει γωνία 〖45〗^0 με την πλευρά αυτή.', 'ans5', 2);
INSERT INTO `questions` VALUES (8, 'Δίνεται τρίγωνο ΑΒΓ με πλευρές α,β,γ.', 'Αν α=β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β και β=γ τότε το τρίγωνο είναι ισοσκελές.', 'Αν α=β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν α≠β≠γ τότε το τρίγωνο είναι ισόπλευρο.', 'ans2', 2);
INSERT INTO `questions` VALUES (9, 'Δίνεται τρίγωνο ΑΒΓ με γωνίες Α,Β,Γ.', 'Αν Α ̂≠Β ̂≠Γ ̂≠Α ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂ και Β ̂=Γ ̂ τότε το τρίγωνο είναι ισοσκελές.', 'Αν Α ̂=Β ̂=Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'Αν Α ̂=Β ̂≠Γ ̂ τότε το τρίγωνο είναι ισόπλευρο.', 'ans4', 2);
INSERT INTO `questions` VALUES (6, 'Σε κάθε ισοσκελές τρίγωνο:', 'Το ύψος που φέρουμε από την κορυφή του είναι διάμεσος και μεσοκάθετος.', 'Η διάμεσος που φέρουμε από την κορυφή του είναι μεσοκάθετος και διχοτόμος.', 'Η διχοτόμος της γωνίας της κορυφής είναι διάμεσος και ύψος.', 'Η μεσοκάθετος είναι διάμεσος και διχοτόμος.', 'Η διάμεσος είναι ύψος και διχοτόμος.', 'ans3', 2);
INSERT INTO `questions` VALUES (7, 'Ποιο από τα παρακάτω είναι το σωστό:', 'Διάμεσος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τελειώνει σ’ ένα σημείο της απέναντι πλευράς και διχοτομεί την πλευρά αυτή.', 'Διάμεσος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τελειώνει σ’ ένα σημείο της απέναντι πλευράς και διχοτομεί την πλευρά αυτή.', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και διχοτομεί την πλευρά αυτή.', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και τριχοτομεί την πλευρά αυτή.', 'Διάμεσος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της διπλανής πλευράς και διχοτομεί την πλευρά αυτή.', 'ans3', 2);
INSERT INTO `questions` VALUES (5, 'Ανάλογα με τις πλευρές τα τρίγωνα διακρίνονται σε:', 'οξυγώνια, αμβλυγώνια και σκαληνά', 'σκαληνά, ισόπλευρα και ισοσκελή', 'σκαληνά, ισοσκελή και οξυγώνια', 'σκαληνά, ισόπλευρα και οξυγώνια', 'σκαληνά, ισόπλευρα και αμβλυγώνια', 'ans2', 2);
INSERT INTO `questions` VALUES (3, 'Τα κριτήρια ισότητας τριγώνων είναι τα:', 'Π-Π-Π, Π-Π-Γ, Γ-Π-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Γ-Π', 'Π-Π-Π, Π-Γ-Π, Π-Γ-Γ', 'Π-Π-Π, Γ-Π-Π, Γ-Π-Γ', 'Π-Π-Π, Π-Γ-Π, Γ-Π-Γ', 'ans5', 2);
INSERT INTO `questions` VALUES (4, 'Ποιο από τα παρακάτω είναι σωστό;', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ομοίως άνισα.', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ανομοίως άνισα.', 'Αν δύο χορδές ενός κύκλου είναι ομοίως άνισες, τότε και τα τόξα τους είναι ίσα.', 'Αν δύο χορδές ενός κύκλου είναι ανομοίως άνισες, τότε και τα τόξα τους είναι ίσα.', 'Αν δύο χορδές ενός κύκλου είναι ίσες, τότε και τα τόξα τους είναι ίσα και αντιστρόφως.', 'ans5', 2);
INSERT INTO `questions` VALUES (1, 'Τα κύρια στοιχεία ενός τριγώνου είναι:', 'οι πλευρές και οι διχοτόμοι', 'οι πλευρές και τα ύψη', 'οι πλευρές και οι γωνίες', 'οι γωνίες και οι διχοτόμοι', 'οι γωνίες και οι διάμεσοι', 'ans3', 2);
INSERT INTO `questions` VALUES (2, 'Σ’ ένα τρίγωνο ισχύει α=γ. Ποιο από τα παρακάτω είναι το σωστό:', 'Α ̂=Γ ̂', 'Α ̂=Β ̂', 'Β ̂=Γ ̂', 'Α ̂=Β ̂=Γ ̂', 'Α ̂=Β ̂≠Γ ̂', 'ans1', 2);
INSERT INTO `questions` VALUES (12, 'Ποιο από τα παρακάτω είναι το σωστό:', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και διχοτομεί τη γωνία της κορυφής.', 'Διχοτόμος τριγώνου είναι η ημιευθεία που έχει αρχή μια κορυφή του τριγώνου και τελειώνει σ’ ένα σημείο της απέναντι πλευράς και διχοτομεί τη γωνία της κορυφής.', 'Διχοτόμος τριγώνου είναι η ευθεία που αρχίζει από μια κορυφή του τριγώνου και τελειώνει σ’ ένα σημείο της απέναντι πλευράς και διχοτομεί τη γωνία της κορυφής.', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της απέναντι πλευράς και τριχοτομεί τη γωνία της κορυφής.', 'Διχοτόμος τριγώνου είναι το ευθύγραμμο τμήμα που ενώνει μια κορυφή του τριγώνου μ’ ένα σημείο της διπλανής πλευράς και διχοτομεί τη γωνία της κορυφής.', 'ans1', 2);
INSERT INTO `questions` VALUES (13, 'Ανάλογα με τις γωνίες τα τρίγωνα διακρίνονται σε:', 'οξυγώνια, αμβλυγώνια και ορθογώνια', 'οξυγώνια, αμβλυγώνια και ισοσκελή', 'οξυγώνια, ορθογώνια και ισόπλευρα', 'οξυγώνια, ισόπλευρα και σκαληνά', 'ορθογώνια, ισόπλευρα και αμβλυγώνια', 'ans1', 2);
INSERT INTO `questions` VALUES (14, 'Ποιο από τα παρακάτω είναι λάθος;', 'Αν δύο τόξα ενός κύκλου είναι ίσα, τότε και οι χορδές τους είναι ίσες και αντιστρόφως.', 'Αν δύο τόξα δύο κύκλων είναι ίσα, τότε και οι χορδές τους είναι ίσες και αντιστρόφως.', 'Αν ένα τόξο ενός κύκλου είναι ίσο με ένα τόξο ενός άλλου κύκλου, τότε και οι χορδές τους είναι ίσες.', 'Αν δύο τόξα δύο ίσων κύκλων είναι ίσα, τότε και οι χορδές τους είναι ίσες και αντιστρόφως.', 'Αν δύο τόξα ενός κύκλου είναι ίσα, τότε και οι χορδές τους είναι ίσες.', 'ans2', 2);
INSERT INTO `questions` VALUES (16, 'Τα δευτερεύοντα στοιχεία ενός τριγώνου είναι:', 'οι πλευρές, οι διχοτόμοι και τα ύψη', 'οι πλευρές, τα ύψη και οι διάμεσοι', 'οι πλευρές, οι γωνίες και οι διχοτόμοι', 'οι διάμεσοι, οι διχοτόμοι και τα ύψη', 'οι γωνίες, οι διάμεσοι και οι διχοτόμοι', 'ans4', 2);

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `scores`
-- 

CREATE TABLE `scores` (
  `ID` int(11) NOT NULL auto_increment,
  `user_name` char(5) NOT NULL,
  `score` int(11) NOT NULL,
  `subject_ID` int(11) NOT NULL,
  PRIMARY KEY  (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `scores`
-- 


-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `subjects`
-- 

CREATE TABLE `subjects` (
  `ID` int(11) NOT NULL auto_increment,
  `subject_name` varchar(20) NOT NULL default '',
  `description` varchar(80) NOT NULL default '',
  PRIMARY KEY  (`ID`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=8 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `subjects`
-- 

INSERT INTO `subjects` VALUES (1, 'ΑΛΓΕΒΡΑ_Α', 'ΑΛΓΕΒΡΑ Α'' ΛΥΚΕΙΟΥ');
INSERT INTO `subjects` VALUES (2, 'ΓΕΩΜΕΤΡΙΑ_Α', 'ΓΕΩΜΕΤΡΙΑ Α ΛΥΚΕΙΟΥ');
INSERT INTO `subjects` VALUES (3, 'ΑΛΓΕΒΡΑ_Β', 'ΑΛΓΕΒΡΑ Β ΛΥΞΕΙΟΥ');
INSERT INTO `subjects` VALUES (4, 'ΓΕΩΜΕΤΡΙΑ_Β', 'ΓΕΩΜΕΤΡΙΑ Β ΛΥΚΕΙΟΥ');
INSERT INTO `subjects` VALUES (5, 'ΜΑΘΗΜΑΤΙΚΑ_Β', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Β ΛΥΚΕΙΟΥ');
INSERT INTO `subjects` VALUES (6, 'ΜΑΘΗΜΑΤΙΚΑ_Γ', 'ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ Γ ΛΥΚΕΙΟΥ');
INSERT INTO `subjects` VALUES (7, 'ΣΤΑΤΙΣΤΙΚΗ_Γ', 'ΣΤΑΤΙΣΤΙΚΗ Γ ΛΥΚΕΙΟΥ');

-- --------------------------------------------------------

-- 
-- Δομή Πίνακα για τον Πίνακα `user`
-- 

CREATE TABLE `user` (
  `id` int(11) NOT NULL auto_increment,
  `username` char(5) NOT NULL,
  `password` char(5) NOT NULL,
  `role` tinyint(1) NOT NULL default '0',
  `fullname` varchar(255) NOT NULL,
  PRIMARY KEY  (`id`),
  UNIQUE KEY `username` (`username`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=5 ;

-- 
-- 'Αδειασμα δεδομένων του πίνακα `user`
-- 

INSERT INTO `user` VALUES (1, 'admin', 'admin', 1, '');
INSERT INTO `user` VALUES (2, 'user1', 'user1', 0, '');
INSERT INTO `user` VALUES (4, 'user3', 'user3', 0, 'fullname');
